In [7]:
# Include all the imports
import pandas as pd
import numpy as np
from sklearn.cluster import KMeans
import hvplot.pandas
import datetime
import psycopg2
import plotly.express as px
import config as creds
import sqlalchemy as sa

from sklearn.preprocessing import OneHotEncoder
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler
from sqlalchemy import create_engine, Table, MetaData
meta = MetaData()

In [8]:
db_string = "postgresql://"+creds.PGUSER +":"+creds.PGPASSWORD+"@"+creds.PGHOST+":5432"   
db_string

'postgresql://postgres:password@uoftproject.cez0q4tbg6aw.us-east-2.rds.amazonaws.com:5432'

In [9]:
engine = create_engine(db_string,isolation_level="AUTOCOMMIT")
connection = engine.connect()

In [10]:
# Read csv into customerSegment_df dataframe
raw_customerdata_df = pd.read_csv("Resourses/marketing_campaign.csv", index_col=False)
raw_customerdata_df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [11]:
# Remove unnecessary columns 
clean_customerdata_df = raw_customerdata_df.drop(["AcceptedCmp3","AcceptedCmp4","AcceptedCmp5","AcceptedCmp1","AcceptedCmp2","Z_CostContact","Z_Revenue"], axis=1)
clean_customerdata_df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,172,88,88,3,8,10,4,7,0,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,2,1,6,2,1,1,2,5,0,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,111,21,42,1,8,2,10,4,0,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,10,3,5,2,2,0,4,6,0,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,46,27,15,5,5,3,6,5,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,42,118,247,2,9,3,4,5,0,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,0,0,8,7,8,2,5,7,0,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,32,12,24,1,2,3,13,6,0,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,80,30,61,2,6,5,10,3,0,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,2,1,21,3,3,1,4,7,0,1

In [12]:
# Rename Columns
clean_customerdata_df = clean_customerdata_df.rename(columns = {
    "ID":"Customer_ID",
    "Kidhome":"Children_Per_Household",
    "Teenhome":"Teens_Per_Household",
    "Dt_Customer":"Date_Enrolled",
    "MntWines":"Wines",
    "MntFruits":"Fruits",
    "MntMeatProducts":"Meat",
    "MntFishProducts":"Fish",
    "MntSweetProducts":"Sweets",
    "MntGoldProds":"Gold",
    "NumDealsPurchases":"Deal_Purchases",
    "NumWebPurchases":"Web_Purchases",
    "NumCatalogPurchases":"Catalog_Purchases",
    "NumStorePurchases":"Store_Purchases",
    "NumWebVisitsMonth":"Web_Visits"
})

In [13]:
# Identify any NANs
clean_customerdata_df.isna().any()

Customer_ID               False
Year_Birth                False
Education                 False
Marital_Status            False
Income                     True
Children_Per_Household    False
Teens_Per_Household       False
Date_Enrolled             False
Recency                   False
Wines                     False
Fruits                    False
Meat                      False
Fish                      False
Sweets                    False
Gold                      False
Deal_Purchases            False
Web_Purchases             False
Catalog_Purchases         False
Store_Purchases           False
Web_Visits                False
Complain                  False
Response                  False
dtype: bool

In [14]:
#To remove the NAN values
clean_customerdata_df = clean_customerdata_df.dropna()
clean_customerdata_df.isna().any()

Customer_ID               False
Year_Birth                False
Education                 False
Marital_Status            False
Income                    False
Children_Per_Household    False
Teens_Per_Household       False
Date_Enrolled             False
Recency                   False
Wines                     False
Fruits                    False
Meat                      False
Fish                      False
Sweets                    False
Gold                      False
Deal_Purchases            False
Web_Purchases             False
Catalog_Purchases         False
Store_Purchases           False
Web_Visits                False
Complain                  False
Response                  False
dtype: bool

In [15]:
# Convert float values to integers
clean_customerdata_df['Income'] = clean_customerdata_df['Income'].astype(int)
clean_customerdata_df

,Customer_ID,Year_Birth,Education,Marital_Status,Income,Children_Per_Household,Teens_Per_Household,Date_Enrolled,Recency,Wines,...,Fish,Sweets,Gold,Deal_Purchases,Web_Purchases,Catalog_Purchases,Store_Purchases,Web_Visits,Complain,Response
0,5524,1957,Graduation,Single,58138,0,0,04-09-2012,58,635,...,172,88,88,3,8,10,4,7,0,1
1,2174,1954,Graduation,Single,46344,1,1,08-03-2014,38,11,...,2,1,6,2,1,1,2,5,0,0
2,4141,1965,Graduation,Together,71613,0,0,21-08-2013,26,426,...,111,21,42,1,8,2,10,4,0,0
3,6182,1984,Graduation,Together,26646,1,0,10-02-2014,26,11,...,10,3,5,2,2,0,4,6,0,0
4,5324,1981,PhD,Married,58293,1,0,19-01-2014,94,173,...,46,27,15,5,5,3,6,5,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223,0,1,13-06-2013,46,709,...,42,118,247,2,9,3,4,5,0,0
2236,4001,1946,PhD,Together,64014,2,1,10-06-2014,56,406,...,0,0,8,7,8,2,5,7,0,0
2237,7270,1981,Graduation,Divorced,56981,0,0,25-01-2014,91,908,...,32,12,24,1,2,3,13,6,0,0
2238,8235,1956,Master,Together,69245,0,1,24-01-2014,8,428,...,80,30,61,2,6,5,10,3,0,0
2239,9405,1954,PhD,Married,52869,1,1,15-10-2012,40,84,...,2,1,21,3,3,1,4,7,0,1

In [16]:
# Convert Date_Enrolled column data type from object to date
clean_customerdata_df['Date_Enrolled'] = pd.to_datetime(clean_customerdata_df['Date_Enrolled'],format = '%d-%m-%Y')

In [17]:
clean_customerdata_df['Marital_Status'].value_counts()

Married     857
Together    573
Single      471
Divorced    232
Widow        76
Alone         3
Absurd        2
YOLO          2
Name: Marital_Status, dtype: int64

In [18]:
clean_customerdata_df['Education'].value_counts()

Graduation    1116
PhD            481
Master         365
2n Cycle       200
Basic           54
Name: Education, dtype: int64

In [19]:
clean_customerdata_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2216 entries, 0 to 2239
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer_ID             2216 non-null   int64
 1   Year_Birth              2216 non-null   int64
 2   Education               2216 non-null   object
 3   Marital_Status          2216 non-null   object
 4   Income                  2216 non-null   int32
 5   Children_Per_Household  2216 non-null   int64
 6   Teens_Per_Household     2216 non-null   int64
 7   Date_Enrolled           2216 non-null   datetime64[ns]
 8   Recency                 2216 non-null   int64
 9   Wines                   2216 non-null   int64
 10  Fruits                  2216 non-null   int64
 11  Meat                    2216 non-null   int64
 12  Fish                    2216 non-null   int64
 13  Sweets                  2216 non-null   int64
 14  Gold                    2216 non-null   int64
 15  Deal_Purchases          2216 non-null   int64
 16  Web_Purchases           2216 non-null   int64
 17  Catalog_Purchases       2216 non-null   int64
 18  Store_Purchases         2216 non-null   int64
 19  Web_Visits              2216 non-null   int64
 20  Complain                2216 non-null   int64
 21  Response                2216 non-null   int64
dtypes: datetime64[ns](1), int32(1), int64(18), object(2)
memory usage: 389.5+ KB

In [20]:
# Rearrange columns
clean_customerdata_df = clean_customerdata_df[[
    "Customer_ID",
    "Year_Birth",
    "Education",
    "Marital_Status",
    "Income",
    "Children_Per_Household",
    "Teens_Per_Household",
    "Date_Enrolled",
    "Recency",
    "Deal_Purchases",
    "Web_Purchases",
    "Catalog_Purchases",
    "Store_Purchases",
    "Web_Visits",
    "Wines",
    "Fruits",
    "Meat",
    "Fish",
    "Sweets",
    "Gold",
    "Complain",
    "Response"
]]
clean_customerdata_df

,Customer_ID,Year_Birth,Education,Marital_Status,Income,Children_Per_Household,Teens_Per_Household,Date_Enrolled,Recency,Deal_Purchases,...,Store_Purchases,Web_Visits,Wines,Fruits,Meat,Fish,Sweets,Gold,Complain,Response
0,5524,1957,Graduation,Single,58138,0,0,2012-09-04,58,3,...,4,7,635,88,546,172,88,88,0,1
1,2174,1954,Graduation,Single,46344,1,1,2014-03-08,38,2,...,2,5,11,1,6,2,1,6,0,0
2,4141,1965,Graduation,Together,71613,0,0,2013-08-21,26,1,...,10,4,426,49,127,111,21,42,0,0
3,6182,1984,Graduation,Together,26646,1,0,2014-02-10,26,2,...,4,6,11,4,20,10,3,5,0,0
4,5324,1981,PhD,Married,58293,1,0,2014-01-19,94,5,...,6,5,173,43,118,46,27,15,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223,0,1,2013-06-13,46,2,...,4,5,709,43,182,42,118,247,0,0
2236,4001,1946,PhD,Together,64014,2,1,2014-06-10,56,7,...,5,7,406,0,30,0,0,8,0,0
2237,7270,1981,Graduation,Divorced,56981,0,0,2014-01-25,91,1,...,13,6,908,48,217,32,12,24,0,0
2238,8235,1956,Master,Together,69245,0,1,2014-01-24,8,2,...,10,3,428,30,214,80,30,61,0,0
2239,9405,1954,PhD,Married,52869,1,1,2012-10-15,40,3,...,4,7,84,3,61,2,1,21,0,1

In [21]:
# Create the customers DataFrame
customers_df = clean_customerdata_df[["Customer_ID",
                                      "Year_Birth",
                                      "Education",
                                      "Marital_Status",
                                      "Income",
                                      "Children_Per_Household",
                                      "Teens_Per_Household"]].copy()
customers_df

,Customer_ID,Year_Birth,Education,Marital_Status,Income,Children_Per_Household,Teens_Per_Household
0,5524,1957,Graduation,Single,58138,0,0
1,2174,1954,Graduation,Single,46344,1,1
2,4141,1965,Graduation,Together,71613,0,0
3,6182,1984,Graduation,Together,26646,1,0
4,5324,1981,PhD,Married,58293,1,0
...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223,0,1
2236,4001,1946,PhD,Together,64014,2,1
2237,7270,1981,Graduation,Divorced,56981,0,0
2238,8235,1956,Master,Together,69245,0,1
2239,9405,1954,PhD,Married,52869,1,1

In [22]:
# Create the orders DataFrame
orders_df = clean_customerdata_df[["Customer_ID",
                                   "Date_Enrolled",
                                   "Recency",
                                   "Deal_Purchases",
                                   "Web_Purchases",
                                   "Catalog_Purchases",
                                   "Store_Purchases",
                                   "Web_Visits"]].copy()
orders_df

,Customer_ID,Date_Enrolled,Recency,Deal_Purchases,Web_Purchases,Catalog_Purchases,Store_Purchases,Web_Visits
0,5524,2012-09-04,58,3,8,10,4,7
1,2174,2014-03-08,38,2,1,1,2,5
2,4141,2013-08-21,26,1,8,2,10,4
3,6182,2014-02-10,26,2,2,0,4,6
4,5324,2014-01-19,94,5,5,3,6,5
...,...,...,...,...,...,...,...,...
2235,10870,2013-06-13,46,2,9,3,4,5
2236,4001,2014-06-10,56,7,8,2,5,7
2237,7270,2014-01-25,91,1,2,3,13,6
2238,8235,2014-01-24,8,2,6,5,10,3
2239,9405,2012-10-15,40,3,3,1,4,7

In [23]:
# Create the products DataFrame. 
products_df = clean_customerdata_df[["Customer_ID",
                                     "Wines",
                                     "Fruits",
                                     "Meat",
                                     "Fish",
                                     "Sweets",
                                     "Gold"]].copy()
products_df

      Customer_ID  Wines  Fruits  Meat  Fish  Sweets  Gold
0            5524    635      88   546   172      88    88
1            2174     11       1     6     2       1     6
2            4141    426      49   127   111      21    42
3            6182     11       4    20    10       3     5
4            5324    173      43   118    46      27    15
...           ...    ...     ...   ...   ...     ...   ...
2235        10870    709      43   182    42     118   247
2236         4001    406       0    30     0       0     8
2237         7270    908      48   217    32      12    24
2238         8235    428      30   214    80      30    61
2239         9405     84       3    61     2       1    21

[2216 rows x 7 columns]

In [24]:
# Create the products DataFrame. 
customer_service_df = clean_customerdata_df[["Customer_ID",
                                             "Complain",
                                             "Response"]].copy()
customer_service_df

      Customer_ID  Complain  Response
0            5524         0         1
1            2174         0         0
2            4141         0         0
3            6182         0         0
4            5324         0         0
...           ...       ...       ...
2235        10870         0         0
2236         4001         0         0
2237         7270         0         0
2238         8235         0         0
2239         9405         0         1

[2216 rows x 3 columns]

In [25]:
# Write customers_df to table in RDS
customers_df.to_sql('customers_table',engine,if_exists='replace',index=False)

In [26]:
# Write orders_df to table in RDS
orders_df.to_sql('orders_table',engine,if_exists='replace',index=False)

In [27]:
# Write products_df to table in RDS
products_df.to_sql('products_table',engine,if_exists='replace',index=False)

In [28]:
# Write customer_service_df to table in RDS
customer_service_df.to_sql('customer_service_table',engine,if_exists='replace',index=False)